MessageBoard/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Wen we get to the bridge drop Khan, I'm pretty sure we're helping him."], ["message_id", 8], ["created_at", "2016-02-19 13:35:58.805154"], ["updated_at", "2016-02-19 13:35:58.805154"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 2], ["updated_at", "2016-02-19 13:37:30.410567"], ["id", 2]]
---
  def create
    @comment = @message.comments.create(comment_params)
    @comment.user_id = current_user.id

    if @comment.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 8]]
---
    def find_message
      @message = Message.find(params[:message_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."message_id" = ? AND "comments"."id" = ? LIMIT 1  [["message_id", 8], ["id", 3]]
---
    def find_comment
      @comment = @message.comments.find(params[:id])