MessageBoard/app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"  ORDER BY created_at DESC
---
  def index
    @messages = Message.all.order("created_at DESC")

INSERT INTO "messages" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Resistance is futile. "], ["description", "-Borg"], ["user_id", 1], ["created_at", "2016-02-19 13:08:11.538545"], ["updated_at", "2016-02-19 13:08:11.538545"]]
---
  def create
    @message = current_user.messages.build(message_params)
    if @message.save

UPDATE "messages" SET "description" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["description", "Kirk comes with.\r\n\r\n-Bones"], ["updated_at", "2016-02-19 11:31:50.822512"], ["id", 4]]
---
  def update
  if @message.update(message_params)

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 2]]
---
  def find_message
    @message = Message.find(params[:id])